# !/usr/bin/env python
# -*- coding:utf-8 -*-


s=[{'time': '2017-04-10 19:26:57', 'ftime': '2017-04-10 19:26:57',
    'context': '您已在重庆东海岸商业街店完成取件，感谢使用菜鸟驿站，期待再次为您服务。', 'location': ''},
   {'time': '2017-04-10 17:26:06', 'ftime': '2017-04-10 17:26:06',
    'context': '您的快件已由重庆东海岸商业街店菜鸟驿站代收。请凭取货码及时取件（查询方式：短信/物流详情页）', 'location': ''},
   {'time': '2017-04-10 16:07:00', 'ftime': '2017-04-10 16:07:00',
    'context': '正在派送途中,请您准备签收(派件人:黎治春,电话:13350388396)', 'location': ''},
   {'time': '2017-04-10 13:39:00', 'ftime': '2017-04-10 13:39:00',
    'context': '快件在【重庆渝北集散中心】已装车，准备发往 【重庆江北北滨一路营业点】', 'location': ''},
   {'time': '2017-04-09 04:23:00', 'ftime': '2017-04-09 04:23:00',
    'context': '快件在【上海集散中心】已装车，准备发往 【重庆渝北集散中心】', 'location': ''},
   {'time': '2017-04-08 19:16:00', 'ftime': '2017-04-08 19:16:00',
    'context': '快件在【南通兴东集散中心】已装车，准备发往 【上海集散中心】', 'location': ''},
   {'time': '2017-04-08 11:07:00', 'ftime': '2017-04-08 11:07:00',
    'context': '快件在【南通如东太行山路营业点】已装车，准备发往 【南通兴东集散中心】', 'location': ''},
   {'time': '2017-04-08 10:16:00', 'ftime': '2017-04-08 10:16:00',
    'context': '顺丰速运 已收取快件', 'location': ''}]

t=[
    {'time': '2017-05-06 12:51:00', 'ftime': '2017-05-06 12:51:00',
    'context': '已签收,感谢使用顺丰,期待再次为您服务', 'location': ''},
   {'time': '2017-05-06 12:17:00', 'ftime': '2017-05-06 12:17:00',
    'context': '快件派送不成功(已与收方客户约定新派送时间 2017-05-06 14:16:00),待再次派送', 'location': ''},
   {'time': '2017-05-06 07:56:00', 'ftime': '2017-05-06 07:56:00',
    'context': '正在派送途中,请您准备签收(派件人:王永佳,电话:17503119197)', 'location': ''},
   {'time': '2017-05-06 07:17:00', 'ftime': '2017-05-06 07:17:00',
    'context': '快件到达 【石家庄市桥西区育新商业街营业点】', 'location': ''},
   {'time': '2017-05-05 22:46:00', 'ftime': '2017-05-05 22:46:00',
    'context': '快件在【石家庄高开集散中心】已装车，准备发往下一站', 'location': ''},
   {'time': '2017-05-05 21:38:00', 'ftime': '2017-05-05 21:38:00',
    'context': '快件到达 【石家庄高开集散中心】', 'location': ''},
   {'time': '2017-05-05 15:52:00', 'ftime': '2017-05-05 15:52:00',
    'context': '快件到达 【北京首都机场集散中心2】', 'location': ''},
   {'time': '2017-05-05 15:52:00', 'ftime': '2017-05-05 15:52:00',
    'context': '快件在【北京首都机场集散中心2】已装车，准备发往下一站', 'location': ''},
   {'time': '2017-05-05 15:30:00', 'ftime': '2017-05-05 15:30:00',
    'context': '快件在【北京国航集散中心】已装车，准备发往下一站', 'location': ''},
   {'time': '2017-05-05 13:48:00', 'ftime': '2017-05-05 13:48:00',
    'context': '快件到达 【北京国航集散中心】', 'location': ''},
   {'time': '2017-05-05 03:04:00', 'ftime': '2017-05-05 03:04:00',
    'context': '快件在【宁波总集散中心】已装车，准备发往下一站', 'location': ''},
   {'time': '2017-05-05 01:21:00', 'ftime': '2017-05-05 01:21:00',
    'context': '快件到达 【宁波总集散中心】', 'location': ''},
   {'time': '2017-05-04 21:36:00', 'ftime': '2017-05-04 21:36:00', 'context': '快件在【宁波鄞州集散中心2】已装车，准备发往下一站', 'location': ''},
   {'time': '2017-05-04 20:25:00', 'ftime': '2017-05-04 20:25:00', 'context': '快件到达 【宁波鄞州集散中心2】', 'location': ''},
   {'time': '2017-05-04 14:40:00', 'ftime': '2017-05-04 14:40:00', 'context': '顺丰速运 已收取快件', 'location': ''}]

s='skhgjh'
print(s[1+1:])